Cinema/src/Reports/НужноСкачать/НужноСкачать.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>НужноСкачать</name>
</mdclass:Report>

Cinema/src/InformationRegisters/СтраныПроизводители/СтраныПроизводители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтраныПроизводители</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Страна</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/InformationRegisters/ЖанрыФильмов/ЖанрыФильмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖанрыФильмов</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Жанр</name>
    <type>
      <types>CatalogRef.Жанры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/Reports/НужноСкачать/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.Наименование + ВЫБОР
		|		КОГДА Фильмы.ОригинальноеНазвание = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" ("" + Фильмы.ОригинальноеНазвание + "")""
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Фильмы.Формат3D
		|			ТОГДА "" 3D""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Наименование,
		|	ВЫБОР
		|		КОГДА Фильмы.ЦифровойРелиз = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Фильмы.ДатаВыхода
		|		ИНАЧЕ Фильмы.ЦифровойРелиз
		|	КОНЕЦ КАК ДатаРелиза,
		|	Фильмы.Афиша КАК Афиша,
		|	ВЫБОР
		|		КОГДА Фильмы.ЦифровойРелиз = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПравилоСортировки
		|ПОМЕСТИТЬ Фильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.НужноСкачать
		|	И НЕ Фильмы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.Владелец КАК Фильм,
		|	ВЫРАЗИТЬ(Аннотации.СодержаниеАннотации КАК СТРОКА(999)) КАК Аннотация
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	Аннотации.Владелец В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|	И НЕ Аннотации.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	СтраныПроизводители.Страна.Представление КАК Страна
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	ЖанрыФильмов.Жанр.Представление КАК Жанр
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Фильм КАК Фильм,
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.ДатаРелиза КАК ДатаРелиза,
		|	Фильмы.Фильм.ЦифровойРелиз КАК ЦифровойРелиз,
		|	Фильмы.Афиша КАК Афиша,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Жанр,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Страна,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Аннотация,
		|	Фильмы.ПравилоСортировки КАК ПравилоСортировки
		|ИЗ
		|	Фильмы КАК Фильмы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	НаибольшийИндекс  = РезультатыЗапроса.ВГраница();
	ОснТаблицаДанных  = РезультатыЗапроса.Получить(НаибольшийИндекс).Выгрузить();
	СтруктураПолей    = Новый Структура("Жанр, Страна, Аннотация");
	СтруктураПоиска   = Новый Структура("Фильм");
	
	Для каждого СтрокаТаблицыДанных Из ОснТаблицаДанных Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицыДанных);
		ТекущийИндекс = НаибольшийИндекс;
	
		Для каждого КлючИЗначение Из СтруктураПолей Цикл
			
			ТекущийИндекс   = ТекущийИндекс - 1;
			Выборка         = РезультатыЗапроса.Получить(ТекущийИндекс).Выбрать();
			ЗначениеКолонки = "";
			
			Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
				ЗначениеКолонки = ЗначениеКолонки + ?(ПустаяСтрока(ЗначениеКолонки), "", ", ") + Выборка[КлючИЗначение.Ключ];
			КонецЦикла;
			 
			СтрокаТаблицыДанных[КлючИЗначение.Ключ] = ЗначениеКолонки;
			
		КонецЦикла;
	
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура("НужноСкачать", ОснТаблицаДанных);
	КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки     = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, СхемаКомпоновкиДанных.НастройкиПоУмолчанию, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
